Revit 2024 API
View.TemporaryViewModes Property
 Data of temporary view modes associated with this view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016 Subscription Update
Syntax
C#
public TemporaryViewModes TemporaryViewModes { get; }
Visual Basic
Public ReadOnly Property TemporaryViewModes As TemporaryViewModes
	Get
Visual C++
public:
property TemporaryViewModes^ TemporaryViewModes {
	TemporaryViewModes^ get ();
}
Remarks
 Temporary view modes are available in graphic views only.
See Also
View Class
Autodesk.Revit.DB Namespace